{
    "Versions": {
        "1.9.4": {
            "notes": "- Presets should be way more intuitive now, if you dont add (X,Y) coords to and u add 'Clicks' it will just do the clicks, if u add (X,Y) coords and no clicks, it will do 1 click anyways because the action its called 'Click', but if u add more 'Clicks' it will instead do the extact ammount of clicks u added on 'Clicks', meaning that if u add a 1 in 'Clicks' on the action that is alredy a click, it will only perform a single click instead of 2.\n- Updated presets loader and fixed bugs.\n- Added 'Hard mode' option to Boss Rush.\n- Challenges will now always be done at XX:00, XX:30\n- Fixed Ant island raid pathing (again).\n- Fixed some issues with the cancel button\n- Fixed the positioning in 'Hill of Swords' map."
        },
        "1.9.3": {
            "notes": "- Fixed presets not working as expected, presets will click on the specified (X, Y) searching for a unit if no unit selected, unless the specified (X,Y) in that Action/Unit Slot is exactly (0,0), if so the macro will not try to select the unit and directly do the preset. (this was a issue since 1.9.0 and configs like 'Challenges + Bounty + Worldlines Config' were having bad win rates)."
        },
        "1.9.2": {
            "notes": "- Fixed super slow positioning.\n- The macro now waits 10s for vote label to appear after finish positioning instead of 60s."
        },
        "1.9.1": {
            "notes": "- Improved positioning.\n- Fixed Ant island raid pathing.\n- Updated auto close chat for the roblox ui, if u still on the old one disable chat keybind on your macro and close the chat by yourself.\n- 'Hill of Swords' and 'Burning Spirit Tree' maps now defends at the back, update your configs."
        },
        "1.9.0": {
            "notes": "- Fixed not begin able to use presets without a unit selected.\n- Added update notification, when u open the macro if u using a old version from 1.9.0 > it will notify u, u can disable this at 'Debug' Tab.\n- Fixed Escanor messing up with detection of some maps, also maybe improved detection for all maps."
        },
        "1.8.9": {
            "notes": "- Added a option to change between 3h rift timer a 1h rift timer."
        },
        "1.8.8": {
            "notes": "- Fixed burning spirit tree map having a wrong position.\n- Added DanDaDan rift and DanDaDan card selector.\n- Added the missing burning spirit tree ex stage\n- Added 'Action in vote' toggle to the first action of configs: 'If turned one the macro will do this action before starting the match (before vote start).'"
        },
        "1.8.7": {
            "notes": "Added all new maps and fixed the macro to work with av 8.0"
        },
        "1.8.5": {
            "notes": "Fixed close roblox bug."
        }
    }
        
}